Repository: ZIDOUZI/Kemono-Downloader-GUI
Catalog: Kemono/Strings/*/DownloadSettingsPage.resw
Source language: en_us
Languages: zh_cn

# DownloadPath.PrimaryText
source: Download Path
zh_cn: 下载路径

# DownloadPath.SecondaryText
source: The root directory of the download. Files and folders will be created under this directory as pattern.
zh_cn: 下载的根目录。文件和文件夹将按照命名方式在此目录下创建。

# DownloadPathBox.PlaceholderText
source: Enter or select the download path.
zh_cn: 输入或选择下载路径

# DownloadPathButton.Content
source: Select
zh_cn: 选择

# Introduction.Text
source: <Span><Bold>{service} </Bold>Source sites such as fanbox, fantia, patreon.</Span><LineBreak /> <Span><Bold>{artist_id} </Bold>The id of the artist.</Span><LineBreak /> <Span><Bold>{artist} </Bold>The artist's name on kemono/commer. Not the name on the source site.</Span><LineBreak /> <Span><Bold>{date} </Bold>Date this post was published.</Span><LineBreak /> <Span><Bold>{title} </Bold>The title of this post.</Span><LineBreak /> <Span><Bold>{post_id} </Bold>ID of this post.</Span><LineBreak /> <Span><Bold>{time} </Bold>Date of download.</Span><LineBreak /> <Span><Bold>{index0} </Bold>(image only) The image sequence number when downloading, starting from the first image, is 0.</Span><LineBreak /> <Span><Bold>{_index0} </Bold>(image only) The image sequence number when downloading, starting from the first image, is 0. Add an underscore <Bold>before</Bold> the number.</Span><LineBreak /> <Span><Bold>{index0_} </Bold>(image only) The image sequence number when downloading, starting from the first image, is 0. Add an underscore <Bold>after</Bold> the number.</Span><LineBreak /> <Span><Bold>{index} </Bold>(image only) The image serial number when downloading, starting from the second image, is 1. The first image does not change.</Span><LineBreak /> <Span><Bold>{_index} </Bold>(image only) The image sequence number when downloading, starting from the second image, is 1. Add an underscore <Bold>before</Bold> the number. The first image does not change.</Span><LineBreak /> <Span><Bold>{index_} </Bold>(image only) The image serial number when downloading, starting from the second image, is 1. Add an underscore <Bold>after</Bold> the number. The first image does not change.</Span><LineBreak /> <Span><Bold>{name} </Bold>The name of the file on the server.</Span><LineBreak /> <Span><Bold>{auto_named} </Bold>The name of the file on the server. If the name is a 32-bit UUID, it will be replaced with a serial number (the first image is named cover)</Span><LineBreak />
zh_cn: <Span><Bold>{service} </Bold>来源网站如fanbox、fantia、patreon。</Span><LineBreak /> <Span><Bold>{artist_id} </Bold>画师的ID。</Span><LineBreak /> <Span><Bold>{artist} </Bold>kemono/commer 上艺术家的名字。不是源站点上的名称。</Span><LineBreak /> <Span><Bold>{date} </Bold>此帖子的发布日期。</Span><LineBreak /> <Span><Bold>{title} </Bold>此帖子的标题。</Span><LineBreak /> <Span><Bold>{post_id} </Bold>此帖子的ID。</Span><LineBreak /> <Span><Bold>{time} </Bold>下载日期。</Span><LineBreak /> <Span><Bold>{index0} </Bold>(仅图像) 下载时的图片序号，从第一张图片开始，为0。</Span><LineBreak /> <Span><Bold>{_index0} </Bold>(仅图像) 下载时的图片序号，从第一张图片开始，为0。在序号<Bold>前</Bold>加下划线。</Span><LineBreak /> <Span><Bold>{index0_} </Bold>(仅图像) 下载时的图片序号，从第一张图片开始，为0。在序号<Bold>后</Bold>加下划线。</Span><LineBreak /> <Span><Bold>{index} </Bold>(仅图像) 下载时的图片序号，从第二张图片开始，为1，第一张图片不变。</Span><LineBreak /> <Span><Bold>{_index} </Bold>(仅图像) 下载时的图片序号，从第二张图片开始，为1。在序号<Bold>前</Bold>加下划线。第一张图像不做更改。</Span><LineBreak /> <Span><Bold>{index_} </Bold>(仅图像) 下载时的图片序号，从第二张图片开始，为1。在序号<Bold>后</Bold>加下划线。第一张图像不做更改。</Span><LineBreak /> <Span><Bold>{name} </Bold>服务器上文件的名称。</Span><LineBreak /> <Span><Bold>{auto_named} </Bold>服务器上文件的名称。如果名称是 32 位 UUID，将替换为序列号（第一个图像命名为cover）</Span><LineBreak />

# Overwrite.PrimaryText
source: Overwrite
zh_cn: 覆盖文件

# Overwrite.SecondaryText
source: Whether to rewrite when downloading in the app. Does not affect the download of unfinished files.
zh_cn: 在应用程序中下载时是否重写。不影响下载未完成的文件。

# Pattern.PrimaryText
source: Pattern
zh_cn: 命名方式

# Pattern.SecondaryText
source: File and folder naming method. Drop down expander to view the specific method.
zh_cn: 文件和文件夹命名方法。下拉查看具体方法。

# RpcHost.PrimaryText
source: RPC Host
zh_cn: RPC地址

# RpcTokenBox.PlaceholderText
source: Do not enter if not.
zh_cn: 如无请勿输入

# UseRpc.PrimaryText
source: Enable RPC
zh_cn: 启用RPC

# UseRpc.SecondaryText
source: Whether to enable RPC. If enabled, please fill in the address and token
zh_cn: 是否启用 RPC。如果启用，请填写地址和token
